[{"description":"Create a 3D print validation website with modern black and white minimal design. The site should allow users to upload STL files (3D models) and validate them against printing guidelines. Features needed: STL file upload interface with drag-and-drop, STL file parser to extract dimensions and geometry data (use a library like three.js with STLLoader), validation engine that checks uploaded models against these Italian manufacturing guidelines: Dimensione max: 50mm (L) x 80mm (W) x 40mm (H), Tolleranza: ±0.1mm su dimensioni minori di 10mm, ±1% su dimensioni maggiori, Spessore Parete: 1mm - 15mm, Requisito geometrico: almeno una base piana di appoggio, Parti concatenate: distanza minima 1mm, Aspect ratio: max 10:1 (consigliato 5:1), Spigoli/raccordi: no spigoli vivi, raggi di curvatura min 0.5mm (se raccordo a T min 2mm), Cavità/fori ciechi: larghezza minima 0.4mm, rapporto profondità-larghezza 2:1 to 4:1, Canali aperti: diametro 1-3mm profondità max 10mm rettilineo, diametro 3-5mm profondità max 30mm rettilineo, diametro >5mm raggio curvatura min 25mm, Incisioni: altezza carattere min 4mm, linee larghezza min 0.5mm, rapporto profondità-larghezza 2:1 to 4:1, Rilievi: altezza carattere min 4mm, linee larghezza min 0.5mm, rapporto profondità-larghezza 2:1 to 3:1, Filettature: filetto abbozzato da M10, Sovrametallo: consigliato per tolleranze stringenti, Oggetti cavi: spessore parete min 1.2mm, necessari almeno 2 fori svuotamento diametro min 2mm (consigliato 4mm). Display validation results clearly showing which guidelines pass or fail with detailed messages in Italian. Show 3D preview of the uploaded model. Use striking hero section with clear call-to-action. Results should be comprehensive and easy to understand for users.","type":"feature","passes":true,"id":1},{"description":"Improve the STL analysis to be much more precise and comprehensive. The current analysis lacks precision. Implement these improvements: 1) SHOW ALL DATA: Display a complete data panel showing all extracted metrics from the STL file - bounding box dimensions, volume, surface area, triangle count, vertex count, edge count, surface normals distribution, mesh statistics. Let users see everything. 2) EDGE/CORNER ANALYSIS (Spigoli e Raccordi): Analyze the mesh to detect sharp edges by calculating dihedral angles between adjacent triangles. Flag edges with angles < 90° as potentially sharp. Estimate curvature radii by analyzing vertex neighborhoods. Detect T-junctions by finding vertices with 3+ edges meeting. Show count of sharp edges found and their locations. 3) CAVITY/BLIND HOLE DETECTION (Cavità e fori ciechi): Analyze mesh topology to find internal concave regions. Detect holes by finding boundary loops in the mesh. Calculate hole dimensions (width, depth) and depth-to-width ratios. Identify blind holes vs through holes. 4) OPEN CHANNEL ANALYSIS (Canali aperti): Detect tubular structures in the mesh by analyzing cross-sections. Measure channel diameters and depths. Check if channels are straight or curved by analyzing the path. Flag channels that violate the guidelines (1-3mm dia max 10mm depth, 3-5mm dia max 30mm depth, >5mm requires 25mm min curve radius). 5) RELIEF/ENGRAVING DETECTION (Rilievi e Incisioni): Analyze surface height variations to detect raised or recessed features. Measure feature heights, widths, and depth-to-width ratios. Check against guidelines (min 4mm character height, min 0.5mm line width, depth-to-width 2:1 to 4:1 for engravings, 2:1 to 3:1 for reliefs). 6) GEOMETRIC COMPLEXITY: Calculate mesh complexity score based on triangle density, surface curvature variance, number of separate components, genus (number of holes). Detect if object has flat base by finding largest planar surface and checking if it's horizontal. 7) WALL THICKNESS: Use ray casting to estimate wall thickness at multiple sample points. Show min/max/average thickness. 8) Display all analysis results in an organized, expandable panel with clear sections. Show numerical values, not just pass/fail. Make it technical but readable. Italian language for all messages.","type":"feature","passes":true,"id":2}]
